**`teams/delius-iaps/iaps_server`** terragrunt plan on `push` event [#87](${url})

```
module.imagebuilder.data.terraform_remote_state.imagebuilder_mp: Reading...
module.imagebuilder.data.terraform_remote_state.core_shared_services_production: Reading...
module.imagebuilder.data.terraform_remote_state.imagebuilder_mp: Read complete after 1s
module.imagebuilder.data.aws_secretsmanager_secret.environment_management: Reading...
module.imagebuilder.data.aws_secretsmanager_secret.environment_management: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.aws_secretsmanager_secret_version.environment_management: Reading...
module.imagebuilder.data.aws_secretsmanager_secret_version.environment_management: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.terraform_remote_state.core_shared_services_production: Read complete after 2s
module.imagebuilder.data.aws_caller_identity.current: Reading...
module.imagebuilder.data.aws_imagebuilder_component.this["amazon-cloudwatch-agent-windows"]: Reading...
module.imagebuilder.data.aws_imagebuilder_component.this["ec2launch-v2-windows"]: Reading...
module.imagebuilder.data.aws_caller_identity.current: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.aws_kms_key.hmpps_ebs_encryption_cmk: Reading...
module.imagebuilder.data.aws_kms_key.hmpps_ebs_encryption_cmk: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.aws_imagebuilder_component.this["ec2launch-v2-windows"]: Read complete after 1s [id=<REDACTED>]
module.imagebuilder.data.aws_imagebuilder_component.this["amazon-cloudwatch-agent-windows"]: Read complete after 2s [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_infrastructure_configuration.this: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_distribution_configuration.this: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_configure_odbcdns.yml"]: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_configure_cloudwatch_agent.yml"]: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_add_manual.yml"]: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_install_oracle_sql_developer.yml"]: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_component.this["add_net_framework_features.yml"]: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_install_im_interface.yml"]: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_install_base_packages.yml"]: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_install_oracle_db_client_tools.yml"]: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_image_recipe.this: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_image_pipeline.this: Refreshing state... [id=<REDACTED>]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.imagebuilder.aws_imagebuilder_component.this["add_net_framework_features.yml"] will be updated in-place
  ~ resource "aws_imagebuilder_component" "this" {
        id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/add-net-framework-features/0.2.0/1"
        name                  = "add_net_framework_features"
      ~ tags                  = {
          + "delius_iaps_install_ndelius_interface-version"      = "0.1.0"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.13" -> "delius_iaps_server/0.0.14"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.13" -> "delius_iaps_server/0.0.14"
            # (19 unchanged elements hidden)
        }
      ~ tags_all              = {
          + "delius_iaps_install_ndelius_interface-version"      = "0.1.0"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.13" -> "delius_iaps_server/0.0.14"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.13" -> "delius_iaps_server/0.0.14"
            # (19 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)
    }

  # module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_add_manual.yml"] will be updated in-place
  ~ resource "aws_imagebuilder_component" "this" {
        id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/delius-iaps-add-manual/0.1.1/1"
        name                  = "delius_iaps_add_manual"
      ~ tags                  = {
          + "delius_iaps_install_ndelius_interface-version"      = "0.1.0"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.13" -> "delius_iaps_server/0.0.14"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.13" -> "delius_iaps_server/0.0.14"
            # (19 unchanged elements hidden)
        }
      ~ tags_all              = {
          + "delius_iaps_install_ndelius_interface-version"      = "0.1.0"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.13" -> "delius_iaps_server/0.0.14"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.13" -> "delius_iaps_server/0.0.14"
            # (19 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)
    }

  # module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_configure_cloudwatch_agent.yml"] will be updated in-place
  ~ resource "aws_imagebuilder_component" "this" {
        id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/delius-iaps-configure-cloudwatch-agent/0.1.0/1"
        name                  = "delius_iaps_configure_cloudwatch_agent"
      ~ tags                  = {
          + "delius_iaps_install_ndelius_interface-version"      = "0.1.0"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.13" -> "delius_iaps_server/0.0.14"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.13" -> "delius_iaps_server/0.0.14"
            # (19 unchanged elements hidden)
        }
      ~ tags_all              = {
          + "delius_iaps_install_ndelius_interface-version"      = "0.1.0"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.13" -> "delius_iaps_server/0.0.14"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.13" -> "delius_iaps_server/0.0.14"
            # (19 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)
    }

  # module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_configure_odbcdns.yml"] will be updated in-place
  ~ resource "aws_imagebuilder_component" "this" {
        id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/delius-iaps-configure-odbc-dsn/0.1.0/1"
        name                  = "delius_iaps_configure_odbc_dsn"
      ~ tags                  = {
          + "delius_iaps_install_ndelius_interface-version"      = "0.1.0"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.13" -> "delius_iaps_server/0.0.14"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.13" -> "delius_iaps_server/0.0.14"
            # (19 unchanged elements hidden)
        }
      ~ tags_all              = {
          + "delius_iaps_install_ndelius_interface-version"      = "0.1.0"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.13" -> "delius_iaps_server/0.0.14"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.13" -> "delius_iaps_server/0.0.14"
            # (19 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)
    }

  # module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_install_base_packages.yml"] will be updated in-place
  ~ resource "aws_imagebuilder_component" "this" {
        id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/delius-iaps-install-base-packages/0.1.2/1"
        name                  = "delius_iaps_install_base_packages"
      ~ tags                  = {
          + "delius_iaps_install_ndelius_interface-version"      = "0.1.0"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.13" -> "delius_iaps_server/0.0.14"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.13" -> "delius_iaps_server/0.0.14"
            # (19 unchanged elements hidden)
        }
      ~ tags_all              = {
          + "delius_iaps_install_ndelius_interface-version"      = "0.1.0"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.13" -> "delius_iaps_server/0.0.14"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.13" -> "delius_iaps_server/0.0.14"
            # (19 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)
    }

  # module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_install_im_interface.yml"] will be updated in-place
  ~ resource "aws_imagebuilder_component" "this" {
        id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/delius-iaps-install-im-interface/0.1.1/1"
        name                  = "delius_iaps_install_im_interface"
      ~ tags                  = {
          + "delius_iaps_install_ndelius_interface-version"      = "0.1.0"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.13" -> "delius_iaps_server/0.0.14"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.13" -> "delius_iaps_server/0.0.14"
            # (19 unchanged elements hidden)
        }
      ~ tags_all              = {
          + "delius_iaps_install_ndelius_interface-version"      = "0.1.0"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.13" -> "delius_iaps_server/0.0.14"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.13" -> "delius_iaps_server/0.0.14"
            # (19 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)
    }

  # module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_install_ndelius_interface.yml"] will be created
  + resource "aws_imagebuilder_component" "this" {
      + arn          = (known after apply)
      + data         = <<-EOT
            ---
            name: delius_iaps_install_ndelius_interface
            description: Installs delius_iaps_install_ndelius_interface
            schemaVersion: 1.0
            parameters:
              - Version:
                  type: string
                  default: 0.1.0
                  description: Component version
              - Platform:
                  type: string
                  default: "Windows"
                  description: Platform name
              - S3ArtefactBucket:
                  type: string
                  description: Name of s3 bucket holding software artefacts
            phases:
              - name: build
                steps:
                  - name: DownloadArtefacts
                    action: ExecutePowerShell
                    inputs:
                      commands:
                        - |
                          $ErrorActionPreference = "Stop"
                          $VerbosePreference = "Continue"
            
                          Read-S3Object -BucketName {{ S3ArtefactBucket }} -KeyPrefix "delius-iaps/apps/ndelius-interface/" -Folder " ${env:TEMP}\ndelius-interface"
                  - name: InstallNDeliusInterface
                    action: ExecutePowerShell
                    inputs:
                      commands:
                        - |
                          $ErrorActionPreference = "Stop"
                          $VerbosePreference = "Continue"
            
                          Start-Process -Wait -FilePath "${env:TEMP}\ndelius-interface\setup.exe" -ArgumentList "/quiet /qn" -Verb RunAs
                          New-Item -ItemType Junction -Path "C:\Program Files\I2N\IapsNDeliusInterface" -Target "C:\Program Files (x86)\I2N\IapsNDeliusInterface"
                  - name: RemoveInvalidShortcut
                    action: ExecutePowerShell
                    inputs:
                      commands:
                        - |
                          Write-Host('Grant local Users group full access recursively to I2N program dir')
                          $i2npath = "C:\Program Files (x86)\I2N"
                          $acl = (Get-Item $i2npath).GetAccessControl('Access')
                          $rule = New-Object System.Security.AccessControl.FileSystemAccessRule("Users", "FullControl", "ContainerInherit,ObjectInherit", "None", "Allow")
                          $acl.SetAccessRule($rule)
                          Set-Acl $i2npath $acl
            
                          Write-Host('Remove invalid shortcut')
                          if ( Test-Path "C:\Users\Public\Desktop\Migration Utility (Iaps-NDelius IF).lnk") {
                            Remove-Item -Path "C:\Users\Public\Desktop\Migration Utility (Iaps-NDelius IF).lnk"
                          }
            
                          Write-Host('Creating new shortcut for all users')
                          $iapsapp = "C:\Program Files (x86)\I2N\IapsNDeliusInterface\PCMSIfConsole.exe"
                          $iapsshortcut = "C:\Users\Public\Desktop\PCMSIfConsole.lnk"
                          $WshShell = New-Object -comObject WScript.Shell
                          $Shortcut = $WshShell.CreateShortcut("$iapsshortcut")
                          $Shortcut.TargetPath = $iapsapp
                          $Shortcut.Save()
            
                          Write-Host('Setting RunAs Adminisrator flag on new shortcut')
                          $bytes = [System.IO.File]::ReadAllBytes("$iapsshortcut")
                          $bytes[0x15] = $bytes[0x15] -bor 0x20 #set byte 21 (0x15) bit 6 (0x20) ON
                          [System.IO.File]::WriteAllBytes("$iapsshortcut", $bytes)
                  - name: DownloadAXMLFile
                    action: ExecutePowerShell
                    inputs:
                      commands:
                        - |
                          $ErrorActionPreference = "Stop"
                          $VerbosePreference = "Continue"
            
                          $url = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/raw/main/teams/delius-iaps/components/files/NDELIUSIF.xml"
                          $output = "${env:TEMP}\ndelius-interface"
                          Invoke-WebRequest -Uri $url -OutFile $output
        EOT
      + date_created = (known after apply)
      + description  = "Installs delius_iaps_install_ndelius_interface"
      + encrypted    = (known after apply)
      + id           = (known after apply)
      + kms_key_id   = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
      + name         = "delius_iaps_install_ndelius_interface"
      + owner        = (known after apply)
      + platform     = "Windows"
      + skip_destroy = false
      + tags         = {
          + "add_net_framework_features-version"                 = "0.2.0"
          + "amazon-cloudwatch-agent-windows-version"            = "1.0.0"
          + "application"                                        = "DELIUS-IAPS"
          + "branch"                                             = "main"
          + "business-unit"                                      = "HMPPS"
          + "delius_iaps_add_manual-version"                     = "0.1.1"
          + "delius_iaps_configure_cloudwatch_agent-version"     = "0.1.0"
          + "delius_iaps_configure_odbc_dsn-version"             = "0.1.0"
          + "delius_iaps_install_base_packages-version"          = "0.1.2"
          + "delius_iaps_install_im_interface-version"           = "0.1.1"
          + "delius_iaps_install_ndelius_interface-version"      = "0.1.0"
          + "delius_iaps_install_oracle_db_client_tools-version" = "0.1.1"
          + "delius_iaps_install_oracle_sql_developer-version"   = "0.1.1"
          + "ec2launch-v2-windows-version"                       = "1.0.0"
          + "image-pipeline"                                     = "delius_iaps_server"
          + "image-recipe"                                       = "delius_iaps_server/0.0.14"
          + "infrastructure-configuration"                       = "delius_iaps_server/0.0.14"
          + "is-production"                                      = "true"
          + "os-version"                                         = "windows server 2022"
          + "owner"                                              = "Probation Webops: probation-webops@digital.justice.gov.uk"
          + "release-or-patch"                                   = "patch"
          + "source-code"                                        = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/delius-iaps"
        }
      + tags_all     = {
          + "add_net_framework_features-version"                 = "0.2.0"
          + "amazon-cloudwatch-agent-windows-version"            = "1.0.0"
          + "application"                                        = "DELIUS-IAPS"
          + "branch"                                             = "main"
          + "business-unit"                                      = "HMPPS"
          + "delius_iaps_add_manual-version"                     = "0.1.1"
          + "delius_iaps_configure_cloudwatch_agent-version"     = "0.1.0"
          + "delius_iaps_configure_odbc_dsn-version"             = "0.1.0"
          + "delius_iaps_install_base_packages-version"          = "0.1.2"
          + "delius_iaps_install_im_interface-version"           = "0.1.1"
          + "delius_iaps_install_ndelius_interface-version"      = "0.1.0"
          + "delius_iaps_install_oracle_db_client_tools-version" = "0.1.1"
          + "delius_iaps_install_oracle_sql_developer-version"   = "0.1.1"
          + "ec2launch-v2-windows-version"                       = "1.0.0"
          + "image-pipeline"                                     = "delius_iaps_server"
          + "image-recipe"                                       = "delius_iaps_server/0.0.14"
          + "infrastructure-configuration"                       = "delius_iaps_server/0.0.14"
          + "is-production"                                      = "true"
          + "os-version"                                         = "windows server 2022"
          + "owner"                                              = "Probation Webops: probation-webops@digital.justice.gov.uk"
          + "release-or-patch"                                   = "patch"
          + "source-code"                                        = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/delius-iaps"
        }
      + type         = (known after apply)
      + version      = "0.1.0"
    }

  # module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_install_oracle_db_client_tools.yml"] will be updated in-place
  ~ resource "aws_imagebuilder_component" "this" {
        id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/delius-iaps-install-oracle-db-client-tools/0.1.1/1"
        name                  = "delius_iaps_install_oracle_db_client_tools"
      ~ tags                  = {
          + "delius_iaps_install_ndelius_interface-version"      = "0.1.0"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.13" -> "delius_iaps_server/0.0.14"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.13" -> "delius_iaps_server/0.0.14"
            # (19 unchanged elements hidden)
        }
      ~ tags_all              = {
          + "delius_iaps_install_ndelius_interface-version"      = "0.1.0"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.13" -> "delius_iaps_server/0.0.14"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.13" -> "delius_iaps_server/0.0.14"
            # (19 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)
    }

  # module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_install_oracle_sql_developer.yml"] will be updated in-place
  ~ resource "aws_imagebuilder_component" "this" {
        id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/delius-iaps-install-oracle-sql-developer/0.1.1/1"
        name                  = "delius_iaps_install_oracle_sql_developer"
      ~ tags                  = {
          + "delius_iaps_install_ndelius_interface-version"      = "0.1.0"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.13" -> "delius_iaps_server/0.0.14"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.13" -> "delius_iaps_server/0.0.14"
            # (19 unchanged elements hidden)
        }
      ~ tags_all              = {
          + "delius_iaps_install_ndelius_interface-version"      = "0.1.0"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.13" -> "delius_iaps_server/0.0.14"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.13" -> "delius_iaps_server/0.0.14"
            # (19 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)
    }

  # module.imagebuilder.aws_imagebuilder_distribution_configuration.this will be updated in-place
  ~ resource "aws_imagebuilder_distribution_configuration" "this" {
        id           = "arn:aws:imagebuilder:eu-west-2:374269020027:distribution-configuration/delius-iaps-server"
        name         = "delius_iaps_server"
      ~ tags         = {
          + "delius_iaps_install_ndelius_interface-version"      = "0.1.0"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.13" -> "delius_iaps_server/0.0.14"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.13" -> "delius_iaps_server/0.0.14"
            # (19 unchanged elements hidden)
        }
      ~ tags_all     = {
          + "delius_iaps_install_ndelius_interface-version"      = "0.1.0"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.13" -> "delius_iaps_server/0.0.14"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.13" -> "delius_iaps_server/0.0.14"
            # (19 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)

      ~ distribution {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.imagebuilder.aws_imagebuilder_image_pipeline.this must be replaced
-/+ resource "aws_imagebuilder_image_pipeline" "this" {
      ~ arn                              = "arn:aws:imagebuilder:eu-west-2:374269020027:image-pipeline/delius-iaps-server" -> (known after apply)
      ~ date_created                     = "2023-02-08T17:02:32.529Z" -> (known after apply)
      ~ date_last_run                    = "2023-02-20T11:30:39.237Z" -> (known after apply)
      ~ date_next_run                    = "2023-04-02T00:00:00.000Z" -> (known after apply)
      ~ date_updated                     = "2023-02-08T17:02:32.529Z" -> (known after apply)
      ~ id                               = "arn:aws:imagebuilder:eu-west-2:374269020027:image-pipeline/delius-iaps-server" -> (known after apply)
      ~ image_recipe_arn                 = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/delius-iaps-server/0.0.13" -> (known after apply) # forces replacement
      ~ infrastructure_configuration_arn = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/delius-iaps-server-0-0-13" -> (known after apply)
        name                             = "delius_iaps_server"
      ~ platform                         = "Windows" -> (known after apply)
      ~ tags                             = {
          + "delius_iaps_install_ndelius_interface-version"      = "0.1.0"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.13" -> "delius_iaps_server/0.0.14"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.13" -> "delius_iaps_server/0.0.14"
            # (19 unchanged elements hidden)
        }
      ~ tags_all                         = {
          + "delius_iaps_install_ndelius_interface-version"      = "0.1.0"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.13" -> "delius_iaps_server/0.0.14"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.13" -> "delius_iaps_server/0.0.14"
            # (19 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)

      ~ schedule {
          + timezone                           = (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.imagebuilder.aws_imagebuilder_image_recipe.this must be replaced
+/- resource "aws_imagebuilder_image_recipe" "this" {
      ~ arn               = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/delius-iaps-server/0.0.13" -> (known after apply)
      ~ date_created      = "2023-02-08T17:02:29.614Z" -> (known after apply)
      ~ id                = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/delius-iaps-server/0.0.13" -> (known after apply)
        name              = "delius_iaps_server"
      ~ owner             = "374269020027" -> (known after apply)
      ~ platform          = "Windows" -> (known after apply)
      ~ tags              = {
          + "delius_iaps_install_ndelius_interface-version"      = "0.1.0"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.13" -> "delius_iaps_server/0.0.14"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.13" -> "delius_iaps_server/0.0.14"
            # (19 unchanged elements hidden)
        }
      ~ tags_all          = {
          + "delius_iaps_install_ndelius_interface-version"      = "0.1.0"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.13" -> "delius_iaps_server/0.0.14"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.13" -> "delius_iaps_server/0.0.14"
            # (19 unchanged elements hidden)
        }
      + user_data_base64  = (known after apply)
      ~ version           = "0.0.13" -> "0.0.14" # forces replacement
      - working_directory = "" -> null
        # (2 unchanged attributes hidden)

      - block_device_mapping {
          - device_name = "/dev/sda1" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 30 -> null
              - volume_type           = "gp3" -> null
            }
        }
      + block_device_mapping {
          + device_name = "/dev/sda1"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 30
              + volume_type           = "gp3"
            }
        }
      - block_device_mapping {
          - device_name = "/dev/xvdf" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - snapshot_id           = "snap-04435aa8246764616" -> null
              - throughput            = 0 -> null
              - volume_size           = 7 -> null
              - volume_type           = "gp3" -> null
            }
        }
      + block_device_mapping {
          + device_name = "/dev/xvdf"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + snapshot_id           = "snap-04435aa8246764616"
              + volume_size           = 7
              + volume_type           = "gp3"
            }
        }

      + component { # forces replacement
          + component_arn = (known after apply) # forces replacement

          + parameter { # forces replacement
              + name  = "S3ArtefactBucket"
              + value = "mod-platform-image-artefact-bucket20230203091453221500000001"
            }
        }

      + systems_manager_agent {
          + uninstall_after_build = (known after apply)
        }

        # (10 unchanged blocks hidden)
    }

  # module.imagebuilder.aws_imagebuilder_infrastructure_configuration.this must be replaced
-/+ resource "aws_imagebuilder_infrastructure_configuration" "this" {
      ~ arn                           = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/delius-iaps-server-0-0-13" -> (known after apply)
      ~ date_created                  = "2023-02-08T17:02:23.365Z" -> (known after apply)
      + date_updated                  = (known after apply)
      ~ id                            = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/delius-iaps-server-0-0-13" -> (known after apply)
      ~ name                          = "delius_iaps_server_0_0_13" -> "delius_iaps_server_0_0_14" # forces replacement
      ~ resource_tags                 = {
          + "delius_iaps_install_ndelius_interface-version"      = "0.1.0"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.13" -> "delius_iaps_server/0.0.14"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.13" -> "delius_iaps_server/0.0.14"
            # (19 unchanged elements hidden)
        }
      ~ tags                          = {
          + "delius_iaps_install_ndelius_interface-version"      = "0.1.0"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.13" -> "delius_iaps_server/0.0.14"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.13" -> "delius_iaps_server/0.0.14"
            # (19 unchanged elements hidden)
        }
      ~ tags_all                      = {
          + "delius_iaps_install_ndelius_interface-version"      = "0.1.0"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.13" -> "delius_iaps_server/0.0.14"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.13" -> "delius_iaps_server/0.0.14"
            # (19 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 4 to add, 9 to change, 3 to destroy.

```
